{
  "1:5": {
    "chapter": 1,
    "verse": 5,
    "arabic": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
    "tafsir": "You [alone] we worship and You [alone] we ask for help Its meaning is “we worship You and we ask for help through You” but beginning with the mention of the object of worship is better than begin- ning with the mention of the servant's attribute which is his worship and seeking help. This is a more eloquent wording and more pleasing to the ears. Worship is bringing the utmost humility in harmony muwāfaqa with the command standing wherever the law stands and asking for help in seeking the assistance of the Real. Worship ʿibāda refers to the exertion of effort and strength while asking for help istiʿāna indicates the search to attract power and grace. So in worship the honor of the servant becomes manifest and in asking for help kindness comes to the servant. In worship he finds his honor and in asking for help he is granted security from harm. The outward aspect of worship is humbling oneself tadhallul but its inward truth is becoming powerful taʿazzuz and beautiful tajammul: When necks are brought low dhallalat in being brought near between us their glory ʿizz is in their humility dhull. Its meaning is: As soon as you caused me to submit to dhāl and lām you met me in ʿayn and zāÌ. Worship is the promenade of the seekers qāṣidūn the recreation of the aspirants murīdūn the meadow of intimacy for the lovers muḥibbūn and the pasture of delight for those with deeper knowledge ʿārifūn. Their eyes are cooled by [worship] their hearts find joy in it and their spirits have rest from it. [The Prophet] ﷺ alluded to this in saying “Give us rest O Bilāl.” One created being said about another created being: O people my blood revenge belongs to my AsmāÌ. Anyone near and far knows it. Do not call upon me except by “O servant of her” For that is the most truthful of my names. To ask for help is to alight in the environs of His generosity to put your burden down in the courtyard of His munificence and to submit your burden to the hand of His rule. So you seek Him full of hope take long strides toward Him hope in Him with powerful anticipation have faith in His eternal generosity trust in what has already been chosen ikhtiyār sābiq and cling to the strong rope of His liberality.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:6": {
    "chapter": 2,
    "verse": 6,
    "arabic": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ سَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ",
    "tafsir": "As for the disbelievers alike it is for them whether you have warned them or have not warned them they do not believe. Those who are veiled by the covering of their own qualities are kept from witnessing His truth. The allusion here is that both are the same to them- the words of one who tries to lead them to the Real ḥaqq or the words of one who aids them in seeking to attract worldly fortune ḥaẓẓ. Nay they are more inclined to the calls to heedlessness and prefer to pay attention to them. How could they not when they are marked with the branding of separation locked in the prison of absence and barred from the place of nearness. None of them will attain faith īmān because they have no security amān from the Real. Because they have not been granted secu- rity lam yuÌmanū they do not believe lam yuÌminū. A decision ḥukm God has already made is inalterable and a word from Him is final. [God's] power cannot be opposed. Fearsome attacks will surprise those who con- test what has been decreed by the Real and the decision [of the Real] will catch them unaware. It is said that the disbeliever does not desist from his error because of the misery that is already his. Likewise the one who is bound by the shackles of his lower self is veiled from witnessing the unseen and His reality for he cannot see the right way or pursue the right course. It is said that for the one who remains in the darknesses of his foolishness the advice of sound guides and the fictions of those who speak falsely are equal to him for God has removed from his states the blessings of being able to judge between two things. He does not come with an ear to acceptance and pays little attention to the one who calls to right conduct. As it is said: My sincere advice naṣīḥatī is the concern of the sincere naṣūḥ. The disobedience of the sincere is My concern alone. It is also said that whoever has strayed from bearing witness to the favors that have been allotted to him imagines that the matter comes from what he does and does not do. [Such a person] relies on his own actions and is blind to witnessing [God's] gifts fa-ittakala ʿalā aʿmālihi wa-taʿāmā ʿan shuhūd afḌālihi.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:10": {
    "chapter": 2,
    "verse": 10,
    "arabic": "فِى قُلُوبِهِم مَّرَضٌ فَزَادَهُمُ ٱللَّهُ مَرَضًا وَلَهُمْ عَذَابٌ أَلِيمٌۢ بِمَا كَانُوا۟ يَكْذِبُونَ",
    "tafsir": "In their hearts is a sickness; and God has increased their sickness; and there awaits them a painful chastisement because they used to lie. In the hearts of the hypocrites is the sickness of making partners [with God] shirk and God increases their sickness in their imagining that they have been saved by deceiving the Muslims. The pain of their grievous punishment will reach them in the end. The allusion pertains to whoever has confused his ultimate objective qaṣd with his worldly concerns ḥaẓẓ and mixed his spiritual desire irāda with his whims hawā taking one step forward with spiritual desire and one step backward with worldly con- cerns and following the lower self. He is neither a sincere seeker murīd nor permanently neglectful. If the hypocrites had been sincere in their beliefs they would have been safe from the punishment in the hereafter just as they were safe from paying the jizya tax and the like in this world in the manner of polytheists and dhimmīs. Similarly if the seeker murīd had been sincere in his spiritual desire he would have reached out in his heart to the realities of the communion [of lovers] and the blessings of sincerity would have reached him and he [would have] attained what he desired. But his state is as it has been said: We have not been firm but justice will be firm with us without bending. If we had been sincere khalaṣnā we would have been saved takhallaṣnā from tribulation. There is a barrier between one whose worship has become weak and the degrees of the gardens darajāt al-jannāt. There is a barrier between one whose spiritual desire has become weak and the intimate communications of nearness and whispered confidences muwāṣalāt al-qurb wa-l-munājāt. As for those who rely on this world and follow [their] whims their reliance on the abode of illusion is an illness of their hearts. The increase in their disease will increase as their greed increases. The more they find something from [this world] the more their greed multiplies for what they have not found hastening the punishment for them. Among [their] immediate punishments are the dissipation of their aims and then the loss of all pleasure in their lives. They are kept by [these punishments] from their Protector mawlā. There will be no enjoyment for them nor rest in what they have preferred when [they] follow their own whims.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:18": {
    "chapter": 2,
    "verse": 18,
    "arabic": "صُمٌّۢ بُكْمٌ عُمْىٌ فَهُمْ لَا يَرْجِعُونَ",
    "tafsir": "deaf dumb blind they shall not return Deaf to hearing the calls of the Real with the ears of their hearts dumb to whispered conversation with the Real with the tongue of their innermost selves blind to witnessing the flow of decreed events with the eyes of their faculties of insight. They shall not return from their persistent shamelessness nor can they be deterred from their wholehearted embrace of errors. It is said deaf to hearing through the Real dumb to speaking through the Real blind to studying creation through the Real. There was no predetermination for them to desist iqlāʿ and no allotment to help them in being deterred irtidāʿ.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:20": {
    "chapter": 2,
    "verse": 20,
    "arabic": "يَكَادُ ٱلْبَرْقُ يَخْطَفُ أَبْصَٰرَهُمْ كُلَّمَآ أَضَآءَ لَهُم مَّشَوْا۟ فِيهِ وَإِذَآ أَظْلَمَ عَلَيْهِمْ قَامُوا۟ وَلَوْ شَآءَ ٱللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَٰرِهِمْ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "tafsir": "The lightning well-nigh snatches away their sight; whensoever it gives them light they walk in it; and when the darkness is over them; they stop; had God willed He would have taken away their hearing and sight; Truly God has power over all things. Part of the similitude of the hypocrites-as also the heedless-is that when they are present at public sermons or their hearts incline to gentleness or some terror overwhelms them their states move closer to repentance and their longing to turn [to God] becomes stronger. But when they revert to their own planning and seek counsel from those close to them their fam- ily and offspring urge them to return to their world. They offer their advice frightening them with weakness and dependency so that their resolve becomes weak their spiritual desire irāda declines and they become as it is said: Whenever he repents he returns to his ignorance just as the one who is feeble suffers a relapse. He said “had God willed He would have taken away their hearing and sight” meaning the outward hearing and seeing of the hypocrites as well as their being deaf and blind inwardly. The same [is true] for the heedless and those who are content with the external aspects of Islam-God most high has the power to negate the positive outcome tawfīq of their practice of outward acts of obedience ẓāhir al-Ṭāʿāt just as He has the power to negate the realization taḥqīq of what they have discovered from the most felicitous states ṣafāÌ al-ḥālāt.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:28": {
    "chapter": 2,
    "verse": 28,
    "arabic": "كَيْفَ تَكْفُرُونَ بِٱللَّهِ وَكُنتُمْ أَمْوَٰتًا فَأَحْيَٰكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
    "tafsir": "How do you disbelieve in God when you were dead and He gave you life; then He shall make you dead then He shall give you life then to Him you shall be returned! These are words to provoke astonishment and gravity in the servant-with the signs that have been made clear his heart should not incline to disbelief. It is said that He makes Himself known to creation by the glimmers of His proofs and the flashes of His signs. He said When you were dead meaning a drop of sperm its parts all the same and He gave you life as a human being with some of the parts of the sperm designated to be bone some parts flesh some parts hair and some parts skin etc. Then He shall make you dead in making you bones and fragments then He shall give you life in raising you up after you were dead then to Him you shall be returned meaning to whatever He previously determined [for you] in happiness or misery. You were dead through your ignorance of Us and He gave you life in your knowledge of Us then He shall make you dead to what you have witnessed then He shall give you life through Him in taking you from yourselves then to Him you shall be returned meaning [returned] to pre- serving the precepts of the law and carrying out what is due. It is said you were dead because your lower selves remained and He gave you life through the annihilation of your lower selves then He shall make you dead from witnessing [this annihilation] so that you will not pay heed to it and corrupt yourselves. Then He shall give you life by taking you from yourselves then to Him you shall be returned by your being turned about in His grasp سبحانه وتعالى. It is said that He holds their states in check so that there is no perpetual life and no complete annihilation. The more they say “this is life”-while they are thus-the more He turns them and annihilates them. Whenever they become annihilated He affirms them and gives them subsistence so they are forever between negation and affirmation between subsistence and annihilation and between wakefulness and erasure. His way is like this with them.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:30": {
    "chapter": 2,
    "verse": 30,
    "arabic": "وَإِذْ قَالَ رَبُّكَ لِلْمَلَٰٓئِكَةِ إِنِّى جَاعِلٌ فِى ٱلْأَرْضِ خَلِيفَةً قَالُوٓا۟ أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ ٱلدِّمَآءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ قَالَ إِنِّىٓ أَعْلَمُ مَا لَا تَعْلَمُونَ",
    "tafsir": "And when your Lord said to the angels “I am appointing on earth a viceregent” they said “What will You appoint therein one who will do cor- ruption therein and shed blood while we glorify You with praise and sanctify Youḍ”; He said “Assuredly I know what you know not.” This is the beginning of the disclosure of His secret regarding Adam and his progeny. He commanded that clay be extracted from every patch of ground and then commanded that it be left to ferment for forty mornings. Every one of the angels was full of amazement: “What is the property ḥukm of this clayḍ” When He assembled [Adam's] form they had never seen anything like it in marvelous craftsmanship and astonishing wisdom. So when He said “I am appointing on earth... ” conjectures were thrown about hearts were scattered and accusations were made. It was just as [the poet] said: How often I have seen someone beautiful but among mortals my choice has fallen upon you. It is said that God سبحانه وتعالى created all the things He created but did not say about any of them what He said about Adam when He said “I am appoint- ing on earth a viceregent.” The external sense of these words resembles mutual consultation if it were to be [part of a conversation] among cre- ated beings. The Real سبحانه وتعالى created the gardens with what is in them and the throne with what it has in well-ordered parts and perfect forms but He did not say “I am creating a throne or a garden or an angel.” Yet He said of Adam “I am appointing on earth a viceregent” as a way of conferring honor and distinction. The words of the angels “What will You appoint therein one who will do corruption thereinḍ” were not an objection to the divine decree but rather a way of seeking to understand it. To interpret the expression in such a way as to absolve the angels of any blame is more fitting since they are sinless. God most high said [in reference to the angels that they are those] Who do not disobey God in what He commands them [66:6]. Others have said that in this speech the Real سبحانه revealed the hidden haughtiness of [the angels'] obedience and the attention they paid to their own acts in their hearts.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:32": {
    "chapter": 2,
    "verse": 32,
    "arabic": "قَالُوا۟ سُبْحَٰنَكَ لَا عِلْمَ لَنَآ إِلَّا مَا عَلَّمْتَنَآ إِنَّكَ أَنتَ ٱلْعَلِيمُ ٱلْحَكِيمُ",
    "tafsir": "They said “Glory be to You! We know not except what You have taught us. Surely You are the Knower Wise.” [The angels] offered praise before they made their apology and declared the truth of His judgment over any objection they might have. It means “We have no knowledge of that which You have asked us about and there is no blame that can be directed to You for charging those who are incapable with something You know they cannot do. Surely You are the Knower Wise that is what You do is true and sincere there is none who can pass judgment over You and there is no foolishness nor ugliness from You.”",
    "tafsir_source": "Al-Qushairi"
  },
  "2:36": {
    "chapter": 2,
    "verse": 36,
    "arabic": "فَأَزَلَّهُمَا ٱلشَّيْطَٰنُ عَنْهَا فَأَخْرَجَهُمَا مِمَّا كَانَا فِيهِ وَقُلْنَا ٱهْبِطُوا۟ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ وَلَكُمْ فِى ٱلْأَرْضِ مُسْتَقَرٌّ وَمَتَٰعٌ إِلَىٰ حِينٍ",
    "tafsir": "Then Satan caused them to slip therefrom and brought them out of what they were in He caused them to slip azallahumā that is “he made them slip” ḥamalahumā ʿalā l-zalla. In actuality nothing gave them free agency except the divine power and nothing turned them about except the divine decree. He brought them out of what they were in publicly with respect to rank and degree but [secretly] their standing only increased in nobility and worth in the determination of the Real سبحانه. and We said “Go down some of you an enemy to the other” Although He sowed enmity between the two of them and Satan [God] سبحانه was with Adam and sided with him in the victory decreed for them. Satan has little weight to assert his enmity because the power of the Real سبحانه is unassailable. God most high said Truly over My servants you shall have no warrant [15:42]. If Satan were to have authority to seduce others he would have had the possibility of guiding himself. How can that beḍ The unique ability to create every thing is one of the characteristics that describe [God] سبحانه. and in the earth a dwelling shall be yours and enjoyment for a while. The place of assembly and familiarity for corporeal forms ashkāl are the regions of the earth. The place of acquaintance and pasture for the spirits arwāḥ is beyond the throne. The expression “beyond” warāÌ though is a metaphor or hyperbole here. How could aspirations have any connec- tion to eventsḍ How could the ascent of intentions toward realities share a location with anything elseḍ",
    "tafsir_source": "Al-Qushairi"
  },
  "2:38": {
    "chapter": 2,
    "verse": 38,
    "arabic": "قُلْنَا ٱهْبِطُوا۟ مِنْهَا جَمِيعًا فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًى فَمَن تَبِعَ هُدَاىَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "tafsir": "We said “Go down from it all together yet there shall come to you from Me guidance and whoever follows My guidance no fear shall befall them neither shall they grieve.” When one displays bad manners on the carpet one is shown the door. When Adam عليه السلام behaved badly at the fountain of nearness God most high said “Go down some of you an enemy to the other; and in the earth a dwelling shall be yours [2:36]-after you had a place of nearness for dwelling and enjoyment for a while.” They were enjoying ease but in the end they returned to want. They have recited: When they became poor they clung to poverty hoping for a reward. Even when things were easy for them they hastened to return to that state. At the same time that [God] expelled [Adam] from the garden and caused him to descend to the earth He gave him the glad tidings that He would return him to his [former] condition if his heart were inclined to return. He said “Yet there shall come to you from Me guidance and who- ever follows My guidance no fear shall befall them neither shall they grieve.”",
    "tafsir_source": "Al-Qushairi"
  },
  "2:42": {
    "chapter": 2,
    "verse": 42,
    "arabic": "وَلَا تَلْبِسُوا۟ ٱلْحَقَّ بِٱلْبَٰطِلِ وَتَكْتُمُوا۟ ٱلْحَقَّ وَأَنتُمْ تَعْلَمُونَ",
    "tafsir": "And do not obscure the truth with falsehood; and do not conceal the truth while you know. “Do not imagine that the two opposites can be joined for you in harmony or that you can be in one state in two places” [for the servant] is either open-hearted in truth mabsūṬ bi-ḥaqq or tied to worldly concerns marbūṬ bi-ḥaẓẓ. The occurrence of the two situations at the same time is impossible. “And do not obscure the truth with falsehood defiling tadnīs and do not conceal the truth deceiving talbīs while you know that sanctification taqdīs is the right of the True ḥaqq al-ḥaqq.” They have recited: O you who are marrying al-Thurayā to Suhayl by your acknowledgment of the everlasting existence of God how can they meetḍ She is of the northern region when she rises while Suhayl is from the south.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:44": {
    "chapter": 2,
    "verse": 44,
    "arabic": "أَتَأْمُرُونَ ٱلنَّاسَ بِٱلْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنتُمْ تَتْلُونَ ٱلْكِتَٰبَ أَفَلَا تَعْقِلُونَ",
    "tafsir": "Will you bid others to piety and forget yourselves while you recite the Bookḍ Do you not understandḍ “Will you rouse others to be foremost while you are content to lag behindḍ” It is also said “Will you call created beings to Us while you hang back from Usḍ Will you give drink to the delegations while you yourselves hold back from the waterḍ Will you vie with others arguing with them over particulars content in your bankruptcy with externalsḍ” It is said “Do you look to the weight of a speck or the measure of a grain in people while you tolerate the mounds of sand and mountains in yourselvesḍ” The one who spoke for them said: Do you look to the mote in my eye when you do not see the beam in your ownḍ It is also said “Do you give the choicest drink while you do not drink in turnḍ” “While you recite the Bookḍ Then you persist obstinately with clandes- tine claims denying the shameful thoughts faḌīḥāt al-khawāṬir and the unmistakable driving cries [to blameworthy things] ṣarīḥāt al-zawājir hidden in your hearts. Do you not understand that these are blameworthy qualities dhamīmun min al-khiṣāl and ugly acts qabīḥun min al-fiʿālḍ”",
    "tafsir_source": "Al-Qushairi"
  },
  "2:45": {
    "chapter": 2,
    "verse": 45,
    "arabic": "وَٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلْخَٰشِعِينَ",
    "tafsir": "Seek help in patience and prayer. For it is grievous except to the humble While patience ṣabr weans the lower self from familiar things maÌlūfāt prayer turns one's attention to the pursuit of intimate communications muwāṣalāt. Patience indicates fleeing from anything other [than God] and prayer indicates perpetual standing in the presence of the unseen. Seeking help by these means takes a great deal of rigor unless the Real discloses Himself to one's heart for in the transmitted tradition [it says] “Truly when God most high discloses Himself to something it becomes humble to Him.” When the Real discloses Himself He lightens and makes easy what creatures must take on. This is [true] because assuming responsibility for acts of obedience is a religious obligation taklīf that is a burden whereas the disclosure [of God happens] by witnessings and through realization taḥqīq and ends in communion tamām al-wuṣla and perpetual near- ness dawām al-zulfa. It is said “Seek help through Me for patience with Me and seek help from Me to preserve for you your prayer for Me so that the incoming wāridāt unveilings and awe will not overwhelm you so much that you will be unable to serve [Me].” Surely it is a great blessing from the Real that He decreases the onslaughts of ecstatic finding saṬawāt al-wujūd upon the heart at the time of unveiling; [thus] the servant is able to perform the acts of separation. There are several kinds of patience all of them praiseworthy. There is patience in God patience for God patience through God and patience with God. There is only one type of patience which is not praiseworthy and that is the type of patience which keeps one from God. Patience is beautiful in all abodes except in resisting you for then it is blameworthy.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:52": {
    "chapter": 2,
    "verse": 52,
    "arabic": "ثُمَّ عَفَوْنَا عَنكُم مِّنۢ بَعْدِ ذَٰلِكَ لَعَلَّكُمْ تَشْكُرُونَ",
    "tafsir": "Then We pardoned you after that so that you might be thankful. The quickness [with which God] pardoned such a grave sin indicates the lesser weight of those who were pardoned. The words of God most high testify to that [in addressing the wives of the Prophet] Whoever of you commits manifest indecency the chastisement shall be doubled for her [33:30]. The children of Israel worshiped the calf so God most high said “Then We pardoned you after that.” To the community [of Muḥammad ﷺ] He said “and whoever does an atom's weight of evil shall see it” [99:8].",
    "tafsir_source": "Al-Qushairi"
  },
  "2:55": {
    "chapter": 2,
    "verse": 55,
    "arabic": "وَإِذْ قُلْتُمْ يَٰمُوسَىٰ لَن نُّؤْمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهْرَةً فَأَخَذَتْكُمُ ٱلصَّٰعِقَةُ وَأَنتُمْ تَنظُرُونَ",
    "tafsir": "And when you said “O Moses we will not believe you till we see God openly”; and the thunderbolt took you while you were beholding. Demanding to see the Essence without divine blessing is an open act of sacrilege which is one of the signs of distance and misery whereas attest- ing to the attribute of [divine] governance in the unveilings of might as linked to the kindnesses of nearness is one of the marks of communion and the tokens of felicity. Surely when they spoke from ignorance without any sense whatsoever of shame the convulsion and the thunderbolt blast overtook them.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:56": {
    "chapter": 2,
    "verse": 56,
    "arabic": "ثُمَّ بَعَثْنَٰكُم مِّنۢ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ",
    "tafsir": "Then We raised you up after you were dead so that you might be thankful. He returned them to consciousness after the blows of punishment over- whelmed them in order to fulfill the decree for them and to implement [God's] way of pardoning sin. One of the aspects of generosity is to lower the veil over the defects of servants.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:59": {
    "chapter": 2,
    "verse": 59,
    "arabic": "فَبَدَّلَ ٱلَّذِينَ ظَلَمُوا۟ قَوْلًا غَيْرَ ٱلَّذِى قِيلَ لَهُمْ فَأَنزَلْنَا عَلَى ٱلَّذِينَ ظَلَمُوا۟ رِجْزًا مِّنَ ٱلسَّمَآءِ بِمَا كَانُوا۟ يَفْسُقُونَ",
    "tafsir": "Then the evildoers substituted a saying other than that which had been said to them; so We sent down upon the evildoers wrath from the heaven for their wickedness. They could neither ward off the opening of heaven above them with their stratagems nor avert the cords of affliction below them by relying on their usual states. They gnashed the teeth of remorse when the fangs of pain bit them. How could this have benefited them when the situation was hopelessḍ",
    "tafsir_source": "Al-Qushairi"
  },
  "2:88": {
    "chapter": 2,
    "verse": 88,
    "arabic": "وَقَالُوا۟ قُلُوبُنَا غُلْفٌۢ بَل لَّعَنَهُمُ ٱللَّهُ بِكُفْرِهِمْ فَقَلِيلًا مَّا يُؤْمِنُونَ",
    "tafsir": "And they say: “Our hearts are encased.” Nay but God has cursed them for their unbelief; and little will they believe. If there had been anything in them free of pretension it would have become easy to find meanings [from God's signs and scripture]. But when [they must] recognize the truth the fangs of pretenders are bared... It is said: When tears flow down cheeks The one who is crying is distinguished from the one who is only pretending.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:101": {
    "chapter": 2,
    "verse": 101,
    "arabic": "وَلَمَّا جَآءَهُمْ رَسُولٌ مِّنْ عِندِ ٱللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ نَبَذَ فَرِيقٌ مِّنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ كِتَٰبَ ٱللَّهِ وَرَآءَ ظُهُورِهِمْ كَأَنَّهُمْ لَا يَعْلَمُونَ",
    "tafsir": "When there came to them a messenger from God confirming what was with them a party of those who had been given the scripture cast away the scripture of God behind their backs as though they did not know. They denied the messengers of the Real that came to their hearts by means of intuitions khawāṬir and [they] belied the messengers who came to them outwardly. O ignorance in which there is not a sliver of deeper knowledge ʿirfān! O deprivation whose companion is disappointment khidhlān!",
    "tafsir_source": "Al-Qushairi"
  },
  "2:128": {
    "chapter": 2,
    "verse": 128,
    "arabic": "رَبَّنَا وَٱجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَآ أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "tafsir": "Our Lord! And make us submissive to You and of our seed a com- munity submissive to You; and show us our holy rites and relent to us. Surely You are the Relenting the Merciful. [That is] “Submissive muslimīn yielding to Your decree so that not one vein of ours throbs without Your good pleasure. Make from our seed a community submissive to You so that after us they will take our place in upholding Your rights.” What a difference between one who seeks someone to inherit his wealth man yaṬlubu wārithan li-mālihi and one who seeks a deputy after him to perform acts of obedience to Him in his states man yaṬlubu nāÌiban... fī aḥwālihi. [That is] “Show us our holy rites since there is no way to know what conforms [to Your will] except by the path that God granted success and communication.” [That is] “And relent to us after we carry out all that You have com- manded us to do so that we do not look to what we do and do not do but turn back to You from witnessing our actions so there is no danger of hidden idolatry al-shirk al-khafī in imagining anything from us or through us.”",
    "tafsir_source": "Al-Qushairi"
  },
  "2:147": {
    "chapter": 2,
    "verse": 147,
    "arabic": "ٱلْحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلْمُمْتَرِينَ",
    "tafsir": "The truth comes from your Lord; then be not among the doubters. i.e. 'after the suns of certainty have appeared to you do not yield to the results of mere guessing'. The address is to [the Prophet] but what is intended by it is the community.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:152": {
    "chapter": 2,
    "verse": 152,
    "arabic": "فَٱذْكُرُونِىٓ أَذْكُرْكُمْ وَٱشْكُرُوا۟ لِى وَلَا تَكْفُرُونِ",
    "tafsir": "So remember Me I will remember you; and be thankful to Me and be not ungrateful toward Me. Remembrance is the immersion of the one who is remembering in the witnessing shuhūd of that which is remembered and then [it is] being consumed in the existence wujūd of that which is being remembered until no trace athar remains of the remembering so that it is said “so and so” once was. So remember me I will remember you that is “be consumed in Our existence wujūd and We will remember you after your annihilation from yourself.” God most high said “For indeed formerly they had been virtu- ous” [51:16]. They were here for a time but they have become perpetually separate bānū dāÌiman: The world is a beautiful [passing] event so be a beautiful event for the one who is aware. The path of the people of literal expression ʿibāra is So remember me by acts of conformity muwāfaqāt [to the divine command] I will remember you with special gifts karāmāt. The path of the people of allu- sion ishāra is “So remember me in abandoning every worldly concern ḥaẓẓ I will remember you by raising you up in My reality ḥaqq after your annihilation from yourselves.” “So remember me by being content with Me instead of with My gifts and favors afḌāl and I will remember you by being pleased with you regard- less of your actions af ʿāl.” “So remember me-and it is by My remembrance of you that you remem- ber for without My prior remembrance your remembrance would not occur.” “So remember me by cutting off attachments ʿalāÌiq and I will remem- ber you by the attributes of realities ḥaqāÌiq.” It is said that “remember Me belongs to everyone you meet and I will remember you belongs to those whom I address.” Whoever remembers Me in a congregation I will remember him in a congregation better than theirs. It is said that “and be thankful to Me for the tremendous blessing to you [refers to when] I said to you 'So remember me I will remember you.'” It is said that gratitude is a kind of remembrance. In His words and be not ungrateful the prohibition against ingratitude kufrān is a com- mand to be grateful. Gratitude is a remembrance so He repeated for you the command to remember.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:158": {
    "chapter": 2,
    "verse": 158,
    "arabic": "إِنَّ ٱلصَّفَا وَٱلْمَرْوَةَ مِن شَعَآئِرِ ٱللَّهِ فَمَنْ حَجَّ ٱلْبَيْتَ أَوِ ٱعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا وَمَن تَطَوَّعَ خَيْرًا فَإِنَّ ٱللَّهَ شَاكِرٌ عَلِيمٌ",
    "tafsir": "Truly ṣafā and Marwa are among the symbols of God These sites and relics tilka al-mashāhidu wa-l-rusūm these ruins and remains wa-tilka al-aṬlālu wa-l-ruqūm are extolled and visited. One sets out for them because they are the ruins of the lovers where the vestiges [still] gleam: The passions of houses belong to those who have lived in them. There is no concern or joy in the house itself. Truly the earth of their path even the dust of their footprints has tre- mendous value for the lovers. Even the smallest bit of dust that falls upon the edges of their path is more precious than the most fragrant musk: And that is only because Umayma walked beside it in a group [of women] trailing a garment. so whoever makes the pilgrimage to the House or the visitation he would not be at fault if he circumambulates them; and whoever volunteers good God is Grateful Knowing. ṣafā and Marwa were favored by being close to the House. The running between the two became part of the law just as the circumambulation became part of the law for the House. Just as the circumambulation is one of the main rites of the pilgrimage so is the running. The neighbor is honored for the sake of the neighbor.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:166": {
    "chapter": 2,
    "verse": 166,
    "arabic": "إِذْ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُوا۟ مِنَ ٱلَّذِينَ ٱتَّبَعُوا۟ وَرَأَوُا۟ ٱلْعَذَابَ وَتَقَطَّعَتْ بِهِمُ ٱلْأَسْبَابُ",
    "tafsir": "When those who were followed disown their followers and they have seen the chastisement and the cords are cut away before them. When the first parts of the punishment appear to [the disbelievers] it will become clear to them that they have nothing sincere upon which to stand. As for the believers they will have their lives possessions spouses and children taken from them [but their sincerity will remain]. [The disbeliev- ers] will be made to reside in the graves for a few years and then He will try them at the resurrection with lengthy terrors and by questioning [their] actions and then cast them in the fire. [But] He will grant [the believers] long days and lives so their love for Him will continue to increase. Because of that He said “those who believe love God more ardently” [2:165].",
    "tafsir_source": "Al-Qushairi"
  },
  "2:169": {
    "chapter": 2,
    "verse": 169,
    "arabic": "إِنَّمَا يَأْمُرُكُم بِٱلسُّوٓءِ وَٱلْفَحْشَآءِ وَأَن تَقُولُوا۟ عَلَى ٱللَّهِ مَا لَا تَعْلَمُونَ",
    "tafsir": "he only commands you to evil and indecency and that you should speak against God what you do not know. Because of his audacity toward God he induces you to speak falsely about God.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:171": {
    "chapter": 2,
    "verse": 171,
    "arabic": "وَمَثَلُ ٱلَّذِينَ كَفَرُوا۟ كَمَثَلِ ٱلَّذِى يَنْعِقُ بِمَا لَا يَسْمَعُ إِلَّا دُعَآءً وَنِدَآءً صُمٌّۢ بُكْمٌ عُمْىٌ فَهُمْ لَا يَعْقِلُونَ",
    "tafsir": "The likeness of those who disbelieve is as the likeness of one who shouts to that which hears nothing save a call and a cry; deaf dumb blind-they do not comprehend. Without the ears of comprehension and acceptance their bodily hearing did not benefit them. They descended to the status of animals incapable of actualization taḥṣīl. Whoever is content to be like an animal man raḌiya an yakūn ka-l-bahīma does not have much worth lam yaqaʿu ʿalayhi kathīr al-qīma.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:182": {
    "chapter": 2,
    "verse": 182,
    "arabic": "فَمَنْ خَافَ مِن مُّوصٍ جَنَفًا أَوْ إِثْمًا فَأَصْلَحَ بَيْنَهُمْ فَلَآ إِثْمَ عَلَيْهِ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
    "tafsir": "But if anyone fears injustice or sin from one making a testament and so makes things right between them then no sin shall be upon him; surely God is Forgiving Merciful. Here the allusion is to the one who recognizes a weakness in one of the aspirants murīdūn or sees in one of the novices ahl al-bidāya a laxity of purpose qaṣd. Or [it may allude to] someone giving counsel [who] speaks with pure sincerity to someone who does not have the capacity for it. He understands his kindness to the aspirant as a form of indulgence encouragement persuasion and permissiveness toward him. This is not objectionable for urging people to pure sincerity [on the path] and [encour- aging them] in what is not yet firmly established in them has an ample reward. Showing kindness to novices who are not yet firm in their resolve or sincere in their effort is a crucial element in seeking to make things right.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:186": {
    "chapter": 2,
    "verse": 186,
    "arabic": "وَإِذَا سَأَلَكَ عِبَادِى عَنِّى فَإِنِّى قَرِيبٌ أُجِيبُ دَعْوَةَ ٱلدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا۟ لِى وَلْيُؤْمِنُوا۟ بِى لَعَلَّهُمْ يَرْشُدُونَ",
    "tafsir": "And when My servants question you concerning Me I am near; I answer the call of the caller when he calls to Me; so let them respond to Me and let them believe in Me that they might go aright. The question of each one indicates his state. They did not ask about any decree created thing this world or what comes next but rather they asked [Muḥammad] about Him so God most high said “And when My servants question you concerning Me...” [These questioners] were not among the group about whom He said “They will question you concerning the mountains” [20:105] nor among the group about whom He said “They will ask you about orphans” [2:220] nor among the group about whom He said “They will ask you about the monthly period” [2:222] nor among the group about whom He said “And they will question you concerning the spirit” [17:85] nor among the group about whom He said “They ask you about wine and divinatory arrows” [2:219] or “They ask you about the sacred month and fighting in it” [2:217]. These were a select group of people. “And when My servants question you concerning Me how could you answer themḍ This answer is not by your tongue O Muḥammad. Even though you are the ambassador between Us and created beings I assume responsibility for this answer: I am near.” In regard to nearness He took away the act of mediating from anyone other than Himself. He did not say “Say to them I am near” but rather He said may His affair be exalted “I am near.” Then He explained what this nearness is. Inasmuch as the Real سبحانه is too holy for drawing near or moving away in terms of direction or speci- fication in any spot buqʿa He said I answer the call of the caller. Verily the Real سبحانه is near wholly and entirely by means of knowledge power hearing and vision. He is near the believers with respect to caretaking help and answering supplications but He is too exalted and holy to be near anyone in essence dhāt or spot buqʿa for He is uniquely without direc- tion in any region aqṬār mighty without being described by substance or measure miqdār. I answer the call of the caller when he calls to Me; so let them respond to Me and let them believe in Me that they might go aright: He did not promise to answer the one who might be considered worthy because of asceticism or [to answer] at the time of worship.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:192": {
    "chapter": 2,
    "verse": 192,
    "arabic": "فَإِنِ ٱنتَهَوْا۟ فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
    "tafsir": "But if they desist surely God is Forgiving Merciful. The allusion in it: When the clamor of your thoughts and the enemies of your self nafs cut you off and they separate you from [God] and jostle you give up the chatter of the lower self nafs and stop its combative motion for surely those who have been asked to guard the innermost selves asrār should not have any business with the exertions of the lower selves nufūs in their various oppositional ways.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:195": {
    "chapter": 2,
    "verse": 195,
    "arabic": "وَأَنفِقُوا۟ فِى سَبِيلِ ٱللَّهِ وَلَا تُلْقُوا۟ بِأَيْدِيكُمْ إِلَى ٱلتَّهْلُكَةِ وَأَحْسِنُوٓا۟ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُحْسِنِينَ",
    "tafsir": "And spend in the way of God; and cast not your own hands into destruction; but be virtuous; God loves the virtuous. The rich spend from their wealth. The worshipers spend through their lower selves by not holding back acts of worship and [religious] tasks. Those who have deep knowledge spend with their hearts by not holding back from His decrees. The lovers spend with their spirits by not holding back from His love. The rich spend from [material] blessings niʿam and the poor fuqarāÌ spend from aspirations himam. The rich spend by taking money from the purse. The poor fuqarāÌ spend by taking [concern for] the rich from the heart. Those who declare God's unity spend by removing [concern for] created things from their innermost selves. His words “and cast not your own hands into destruction” allude to holding back your hands from exertion for the one who holds back his hands and hoards anything for himself his hands throw him into destruction. It is said that it is to prefer your whims over [God's] good pleasure. It is also said and cast not your own hands into destruction means being heedless of Him by [your own] free choice. It is also said [it is] imagining that you can live without His kindness and His favor for even a moment. It is also said [it is] contentment in your state of lassitude and being veiled. It is also said [it is] holding the tongue back from perpetually seeking help in every breath. His words “But be virtuous God loves the virtuous muḥsinūn”: Virtuousness iḥsān is being kind with everyone but yourself. When you are virtuous with regard to your lower self it looks-to those with poor judgment-like you are harming it. But it is through [your lower self] that you bring about every misery and endure every calamity. Virtuousness is also leaving every last bit of your worldly concerns and devoting your- self to fulfilling the right of anyone whose affair is connected to you. Virtuousness is to worship Him without becoming inattentive and to wor- ship Him through the quality of witnessing.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:199": {
    "chapter": 2,
    "verse": 199,
    "arabic": "ثُمَّ أَفِيضُوا۟ مِنْ حَيْثُ أَفَاضَ ٱلنَّاسُ وَٱسْتَغْفِرُوا۟ ٱللَّهَ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
    "tafsir": "Then press on from where the people press on and seek God's forgive- ness; God is Forgiving Merciful. The allusion [in this part of the verse] is that you should not see yourself as different from others because of some manner of dressing patched clothing or some quality that distinguishes you outwardly. Rather you should [consider yourself only as] one among [all] humanity. When the thought comes to you that you have done something or that anything [happens] through you for you or with you seek God's forgiveness and renew your faith for [this kind of thought] is a hidden idolatry shirk that infects your heart.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:205": {
    "chapter": 2,
    "verse": 205,
    "arabic": "وَإِذَا تَوَلَّىٰ سَعَىٰ فِى ٱلْأَرْضِ لِيُفْسِدَ فِيهَا وَيُهْلِكَ ٱلْحَرْثَ وَٱلنَّسْلَ وَٱللَّهُ لَا يُحِبُّ ٱلْفَسَادَ",
    "tafsir": "And when he turns his back he hastens about the earth to do cor- ruption there and to destroy the tillage and the stock; and God loves not corruption. [Here] the allusion is to those who only hasten to seek worldly fortunes. They are not concerned even though the ties to their religion have become unraveled and their bonds to Islam have been weakened. After that the ropes [tying them to] the world become stronger and the bonds of their desires become more closely woven with the prohibited things they have gathered and the debris they have acquired. When they retire to their whis- perings and ruinous aims they hasten to corruption make decisions based on worldly [aims] and employ people to help them in furthering their affairs-people from whose hearts God has removed inner sight. And God loves not corruption: Outward corruption is whatever brings about the ruin of religious affairs and the proper ordering of worldly matters.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:226": {
    "chapter": 2,
    "verse": 226,
    "arabic": "لِّلَّذِينَ يُؤْلُونَ مِن نِّسَآئِهِمْ تَرَبُّصُ أَرْبَعَةِ أَشْهُرٍ فَإِن فَآءُو فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
    "tafsir": "For those who forswear their women a wait of four months; if they revert God is Forgiving Merciful. Though the right of companionship with one's mate is upheld for you- unless you relinquish it-you are nonetheless held to His rule for the right of the Real has even more right ḥaqqu al-ḥaqqi aḥaqqu to be observed. If they revert that is they turn back to revive what they have let die and rectify what they have squandered God is Forgiving Forbearing. Because the wife has a lesser voice because she is captive asīr in the hands of her spouse God سبحانه takes charge of the affair and preserves her right and commands the husband to return to her or release her.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:239": {
    "chapter": 2,
    "verse": 239,
    "arabic": "فَإِنْ خِفْتُمْ فَرِجَالًا أَوْ رُكْبَانًا فَإِذَآ أَمِنتُمْ فَٱذْكُرُوا۟ ٱللَّهَ كَمَا عَلَّمَكُم مَّا لَمْ تَكُونُوا۟ تَعْلَمُونَ",
    "tafsir": "And if you are in fear then standing or mounted. But when you are secure then remember God as He taught you what you knew not. That is “Do not abandon intimate conversations with Me at their [desig- nated] times in the way I have made possible for you for truly I am the One who gives power over you to the enemies you fear. But when you withdraw in your hearts through Me their hands will be unable to reach you since I have appointed victory for you over them. Then when the fear is gone from you and you are secure return to what you have established [in prayers] and exert your utmost in the times of your devotion in My presence in private or in public.”",
    "tafsir_source": "Al-Qushairi"
  },
  "2:244": {
    "chapter": 2,
    "verse": 244,
    "arabic": "وَقَٰتِلُوا۟ فِى سَبِيلِ ٱللَّهِ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٌ",
    "tafsir": "So fight in God's way and know that God is Hearing Knowing. This means “If pain touches you and a cry rises up from you know that God hears your cry knows your states and sees your affairs.” The verse brings about an easing of the pain they endure. They said: While most people want ease and comfort I wish to complain to you for then you will hear.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:263": {
    "chapter": 2,
    "verse": 263,
    "arabic": "قَوْلٌ مَّعْرُوفٌ وَمَغْفِرَةٌ خَيْرٌ مِّن صَدَقَةٍ يَتْبَعُهَآ أَذًى وَٱللَّهُ غَنِىٌّ حَلِيمٌ",
    "tafsir": "Honorable words and forgiveness are better than voluntary almsgiving followed by injury; and God is Independent Forbearing. This means that words spoken to the one who is poor and deprived- responding to his overture without showing censure-are better and more perfect than the alms of one who is proud of what he does and then imposes an obligation for it. It is said that an acknowledgment from you to God of your weakness and sin and God's forgiveness for you in response to these words is better than alms adulterated with reproach and accompanied by injury.",
    "tafsir_source": "Al-Qushairi"
  },
  "2:276": {
    "chapter": 2,
    "verse": 276,
    "arabic": "يَمْحَقُ ٱللَّهُ ٱلرِّبَوٰا۟ وَيُرْبِى ٱلصَّدَقَٰتِ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ",
    "tafsir": "God effaces usury but He augments voluntary almsgivings with inter- est. God loves not any guilty ingrate. The behaviors He has permitted are connected to good things fa-maqrūnun bi-l-khayrāt and are accompanied by blessings wa-maṣḥūbun bi-l-barakāt while [behaviors] that arise from [personal] whims come to naught-loss is the end of the affair of one [who follows his own whims].",
    "tafsir_source": "Al-Qushairi"
  },
  "2:280": {
    "chapter": 2,
    "verse": 280,
    "arabic": "وَإِن كَانَ ذُو عُسْرَةٍ فَنَظِرَةٌ إِلَىٰ مَيْسَرَةٍ وَأَن تَصَدَّقُوا۟ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ",
    "tafsir": "And if any man should be in difficulty then [let there be] respite till things are easier; but that you should give a voluntary almsgiving is better for you did you but know. When the insolvency of a detained man is determined before the judge it is not permissible to continue his detention. If the proof of the man's insolvency is demonstrated that [proof] is taken in security for what is due his adversary. But he is in a period of respite and delay. In that the Lord does not judge us but with His knowledge of our difficulties and weakness and the sincerity of our need for Him and our dedication to Him He is merciful with us. His words “till things are easier” [relate to] the poor insolvent man [who] has no way to obtain anything for himself except through what God سبحانه appoints for him as the portion of debtors. Income accrues to those who have the goods and the contract. What does the insolvent [per- son] have to do with itḍ What does the insolvent [person] have to do with profit in trade from the transformation of capital and what is done with itḍ What is left for the insolvent [person]ḍ The jurists say he must seek work if he is healthy. If he is weak then this [statement that he must seek work] applies only if he has enough physical strength. As for those who are bankrupt in vigor just as one is bankrupt in wealth what way remains for him except what his Protector appoints for himḍ",
    "tafsir_source": "Al-Qushairi"
  },
  "2:281": {
    "chapter": 2,
    "verse": 281,
    "arabic": "وَٱتَّقُوا۟ يَوْمًا تُرْجَعُونَ فِيهِ إِلَى ٱللَّهِ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
    "tafsir": "And fear a day wherein you shall be returned to God and every soul shall be paid in full what it has earned; and they shall not be wronged. There are two kinds of return: [a return] for the bodily and lower selves in the future at the time of death and [a return] for the innermost selves and hearts at every breath. [The latter is] a reckoning-a payment in ready cash versus a promise [regarding the future]. The payment in ready cash for His claim [at every breath] is more fitting than what will come at the resurrection by His promise. He said to ordinary people “And fear a day” and He said to the elect “and fear Me” [2:41].",
    "tafsir_source": "Al-Qushairi"
  },
  "2:284": {
    "chapter": 2,
    "verse": 284,
    "arabic": "لِّلَّهِ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ وَإِن تُبْدُوا۟ مَا فِىٓ أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ ٱللَّهُ فَيَغْفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "tafsir": "To God belongs all that is in the heavens and the earth. Whether you disclose what is in your hearts or hide it God shall take you to account yuḥāsibkum for it. Then He will forgive whom He wishes and chastise whom He wishes. And God has power over all things. [That is] whether you disclose what is in your hearts in deep intuitions maʿānī or pretensions daʿāwā. It is said that whether you disclose what is in your hearts [refers to] intentions and wishes al-quṣūd wa-l-raghāÌib and various needs and requests funūn al-ḥawāÌiḥ wa-l-maṬālib. It is said that what you disclose is worship ʿibāda and what you hide is desire irāda. It is said that what you hide are thoughts khaṬarāt and what you dis- close are your states of rest and movement sakanāt wa-l-ḥarakāt. It is said that the allusion is to perpetual observation istidāmat al-murāqaba and holding fast to the accounting muḥāsaba436 so that you will not be heedless for a moment not even for a breath.",
    "tafsir_source": "Al-Qushairi"
  },
  "32:1": {
    "chapter": 32,
    "verse": 1,
    "arabic": "الٓمٓ",
    "tafsir": "Alif Lām Mīm His saying “Alif” alludes to His being sufficient for you in all of your states. You are captive to heedlessness and have not found the way to right action and thinking. He is the One who sets in motion what restores you and is solely sufficient for you in what helps you. Without your asking-and even without you knowing your own state-He suffices for you even if you do not perceive it. He gives to you without your seeking. The Lām alludes to His kindness luṬf to you at the most subtle and hidden level so much so that the locus of favor by which He strengthens you is not apparent to you. The Mīm alludes to the harmony muwāfaqa of the stream of the [divine] determination of events taqdīr with the circumstances requested by the friends. Nothing in the world moves no particle appears unless it is an occasion of good pleasure with respect to them. It would not be going too far to say that in His words “Every day He is upon some matter” [55:29] the “matter” is an actualization of what the friends desire. It is said that by listening to these disconnected letters [Alif Lām Mīm] which are contrary to the ordinary customs of human discourse every concept disappears from the hearts whether it be a known written cus- tomary or imagined thing and whether it arises from necessity Ḍarūra sensory perception ḥiss or independent reasoning ijtihād. When the hearts are emptied of imagined and known concepts and the innermost selves are purified of customary and familiar things the name Allāh comes to a heart sanctified from everything other [than Him] and to an innermost self purified of every mode [of inquiry] kayf.",
    "tafsir_source": "Al-Qushairi"
  },
  "3:5": {
    "chapter": 3,
    "verse": 5,
    "arabic": "إِنَّ ٱللَّهَ لَا يَخْفَىٰ عَلَيْهِ شَىْءٌ فِى ٱلْأَرْضِ وَلَا فِى ٱلسَّمَآءِ",
    "tafsir": "Nothing whatever is hidden in heaven and earth from God. A servant does not breathe a single breath without God سبحانه وتعالى counting it muḥṣīhi. Not a particle exists in the heaven and earth unless He is its originator and creator mubdiʿ hi. No one has any quality or attribute except He is its governor mutawallīhi. This is the view of ordinary people ʿumūm. As for the elect khuṣūṣ no one presents a need to Him except He satisfies it qāḌīhā and no one has any resource in a calamity except He suffices for it kāfīhā.",
    "tafsir_source": "Al-Qushairi"
  },
  "3:8": {
    "chapter": 3,
    "verse": 8,
    "arabic": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ ٱلْوَهَّابُ",
    "tafsir": "Our Lord do not cause our hearts to deviate after You have guided us; and give us mercy from You; You are the Bestower. They do not increase in nearness unless they increase in refined behavior adab. To take refuge in maintaining distance is the most powerful means for respecting proper behavior adab. It is said that when they sincerely call for help in a beautiful manner they are assisted by the lights of [divine] sufficiency.",
    "tafsir_source": "Al-Qushairi"
  },
  "3:9": {
    "chapter": 3,
    "verse": 9,
    "arabic": "رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ إِنَّ ٱللَّهَ لَا يُخْلِفُ ٱلْمِيعَادَ",
    "tafsir": "Our Lord You shall gather mankind for a day of which there is no doubt; verily God will not fail the tryst. Today is the gathering of the lovers on the carpet of approach iqtirāb and tomorrow will be the gathering of all in the place of reward thawāb and punishment ʿiqāb. Today is the gathering of innermost selves asrār for the unveiling of [divine] Majesty jalāl and Beauty jamāl and tomor- row will be the gathering of human beings abshār to witness the terrors ahwāl and endure what has been told of these states aḥwāl.",
    "tafsir_source": "Al-Qushairi"
  },
  "3:12": {
    "chapter": 3,
    "verse": 12,
    "arabic": "قُل لِّلَّذِينَ كَفَرُوا۟ سَتُغْلَبُونَ وَتُحْشَرُونَ إِلَىٰ جَهَنَّمَ وَبِئْسَ ٱلْمِهَادُ",
    "tafsir": "Say to the disbelievers: “You shall be vanquished and mustered to hell- an evil resting place! He informed them that the speech of the Real will elude them in the future ājil and they will have no delight in living in the present #703;ājil. In the hereafter what they will encounter will be from the severity of the punishment by burning ḥurqa. What [already] afflicts them in this world is absence and separation furqa from God but their faculties of insight have become weak and they do not perceive the pain of [that] punishment.",
    "tafsir_source": "Al-Qushairi"
  }
}