{
  "surah_number": 111,
  "user_introduction": "Surah Al-Masad (juga dikenal sebagai Surah Lahab) adalah salah satu surah Makkiyah yang sangat pendek tetapi sarat muatan historis dan teologis. Ia turun pada fase awal dakwah di Makkah, ketika permusuhan terhadap Nabi ﷺ mulai menampakkan bentuk yang semakin kasar dan terang-terangan. Nama “Al-Masad” diambil dari kata “masad” pada ayat terakhir yang berarti tali dari serat kasar, sedangkan sebutan “Lahab” merujuk pada kun-yah tokoh yang menjadi pusat surah ini: Abu Lahab, paman Nabi ﷺ. Menariknya, ini adalah satu-satunya surah dalam Al-Qur’an yang menyebut musuh Islam secara eksplisit dengan nama (kun-yah), menunjukkan bahwa kasus ini bukan sekadar konflik pribadi, melainkan pelajaran sejarah dan akidah yang sangat penting.\\n\\nSecara kronologis, kebanyakan ulama menempatkannya di fase awal dakwah terbuka, setelah Nabi ﷺ diperintahkan untuk memperingatkan kerabat terdekat dan kemudian seluruh masyarakat Quraisy. Meski urutan pastinya di dalam rangkaian wahyu sulit dipastikan, konteks perilaku Abu Lahab mengisyaratkan bahwa surah ini turun ketika permusuhannya telah melewati batas kewajaran sosial: ia bukan hanya menolak, tetapi secara aktif dan sistematis menghalangi dakwah, menghina Nabi di depan umum, memutus silaturahmi, dan memanfaatkan status kekerabatan untuk merusak reputasi Rasul ﷺ. Perilaku ini menjadi sangat mencolok di masyarakat Arab saat itu, karena mereka sangat menjunjung tinggi silah rahim dan loyalitas kabilah.\\n\\nKonteks sosial Arab Jahiliyah penting dipahami untuk menangkap bobot kecaman dalam surah ini. Di tengah kondisi politik yang kacau dan rentan kekerasan, seseorang hanya merasa aman dengan perlindungan kabilah dan kerabat. Menjaga hubungan keluarga adalah nilai moral tertinggi, dan mengkhianati keluarga dipandang sebagai tercela, bahkan oleh orang musyrik sekalipun. Dalam situasi seperti itu, Bani Hasyim dan Bani Al-Muththalib, meski banyak di antara mereka belum beriman, tetap membela Nabi ﷺ sebagai sesama kerabat. Satu-satunya pengecualian besar adalah Abu Lahab. Ia justru bergabung dengan kubu musuh dan melawan keluarganya sendiri, termasuk pada saat pemboikotan Bani Hasyim di Syi‘b Abi Thalib. Pelanggaran terang-terangan terhadap norma sosial yang paling dijunjung inilah yang menjadi latar moral dari turunnya surah ini.\\n\\nSurah Al-Masad juga tidak bisa dilepaskan dari kisah ketika Nabi ﷺ pertama kali mengumpulkan kabilahnya di bukit Shafa, memperingatkan mereka tentang azab Allah sebagaimana orang yang memberi alarm bahaya: “Wahai Bani Hasyim, wahai Bani Abdul Muththalib…”. Saat semua mengakui kejujurannya, Abu Lahab memotong suasana dengan seruan kasar dan doa keburukan: “Celaka engkau! Apakah hanya untuk ini engkau memanggil kami?” Dari momen publik yang sangat simbolik inilah kemudian turun firman Allah: \"تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ\" – “Binasalah kedua tangan Abu Lahab, dan benar-benar ia pun binasa.” (ayat 1). Di sini, respons langit turun terhadap hinaan paling keras seorang kerabat yang semestinya menjadi pelindung.\\n\\nTema sentral surah ini adalah kehancuran total proyek permusuhan terhadap risalah, betapapun kuat sandaran duniawinya: nasab, harta, dan status sosial. Abu Lahab bukan orang biasa: ia paman Nabi, bangsawan Quraisy, kaya, berpengaruh, dan tinggal bertetangga dengan Rasul ﷺ. Namun surah ini menegaskan bahwa semua kapital duniawi itu tidak memiliki nilai di hadapan Allah jika digunakan untuk menentang kebenaran: \"مَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَ\" – “Tidaklah berguna baginya hartanya dan apa yang ia usahakan.” (ayat 2). Tema besar ini menjawab ilusi masyarakat Makkah saat itu yang mengira kedudukan, harta, dan jaringan sosial bisa menjadi tameng dari azab dan ukuran kemuliaan di sisi Tuhan.\\n\\nTema penting berikutnya adalah gugurnya privilese kekerabatan dalam urusan iman. Dengan menyebut paman Nabi ﷺ secara terang, surah ini mendidik umat bahwa kedekatan darah dengan Rasul tidak menjamin keselamatan jika ia menolak risalah. Ini sekaligus menjawab harapan sebagian orang Quraisy bahwa Nabi, karena pertimbangan kekeluargaan, akan bersikap lunak kepada kerabatnya yang paling keras menentang. Al-Masad adalah deklarasi bahwa standar utama adalah iman dan sikap terhadap kebenaran, bukan garis keturunan. Ini sejalan dengan pesan surah-surah lain seperti Al-Kauthar dan Al-Kafirun, tetapi di sini ia diinkarnasikan dalam sosok nyata yang dikenal semua orang.\\n\\nSurah ini juga mengangkat tema keterlibatan keluarga dalam proyek kejahatan. Istri Abu Lahab, Ummu Jamil, bukan sekadar “korban” atau pihak pasif; ia hadir sebagai mitra aktif dalam permusuhan, digambarkan sebagai “حَمَّالَةَ الْحَطَبِ” – “pembawa kayu bakar” (ayat 4). Secara literal, ini menggambarkan perannya sebagai penyulut fitnah dan gangguan (melempar duri di jalan Nabi, menyebarkan hasutan di pasar dan majelis). Secara maknawi, ia menjadi simbol bahwa relasi rumah tangga bisa menjadi kekuatan yang mengabadikan keburukan, sebagaimana ia bisa menjadi kekuatan penopang ketaatan. Dengan demikian, surah ini menjawab problem moral: bagaimana Allah menilai pasangan yang saling menopang dalam dosa? Jawabannya: mereka akan menuai konsekuensi bersama pula.\\n\\nJika dilihat dari sisi arsitektur, meskipun hanya lima ayat, Surah Al-Masad memiliki struktur yang sangat padat dan terfokus. Ayat pertama berfungsi sebagai pembukaan yang mengumumkan vonis: kebangkrutan total “tangan” Abu Lahab – yang melambangkan usaha, kekuatan, dan kekuasaannya – sekaligus memastikan bahwa kebinasaan itu sudah menjadi realitas yang ditetapkan (\"وَتَبَّ\"). Ayat kedua menjelaskan secara singkat tetapi tajam bahwa sumber-sumber kekuatan duniawi yang paling ia banggakan – harta dan segala pencapaiannya – tidak sedikit pun mampu menolongnya. Dengan demikian, dua ayat pertama adalah blok pembukaan yang mengumumkan kehancuran dan menolak klaim-klaim duniawi.\\n\\nAyat ketiga menjadi transisi dari vonis ke gambaran balasan: \"سَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍ\" – “Kelak ia akan masuk ke dalam api yang bergejolak.” Di sini terjadi permainan kata (jinās) antara “Lahab” sebagai kun-yah dirinya dan “lahab” sebagai nyala api, sehingga seolah-olah identitas duniawinya berbalik menjadi simbol azab ukhrawi. Struktur surah kemudian berkembang pada ayat keempat dan kelima dengan memasukkan sosok istrinya: mula-mula dengan sifat perannya di dunia (pembawa kayu bakar), lalu dengan gambaran hukuman yang sesuai (tali dari serat kasar di lehernya). Maka, secara arsitektural, surah ini bergerak dari vonis individu (Abu Lahab), ke penegasan kegagalan semua modal duniawinya, lalu ke gambaran hukuman di akhirat, dan ditutup dengan penggambaran hukuman pasangan yang menjadi sekutu dalam keburukan. Semua itu diikat oleh tema konsistensi: siapa yang menyalakan “api” permusuhan di dunia, akan berhadapan dengan “api” yang hakiki di akhirat.\\n\\nDalam munasabat (keterkaitan antar-surah), posisi Al-Masad setelah Surah An-Nasr dalam mushaf juga menarik. Surah An-Nasr menggambarkan kemenangan Islam dan masuknya manusia ke dalam agama Allah berbondong-bondong, sementara Al-Masad langsung memperlihatkan nasib salah satu musuh paling keras yang justru menggunakan kedekatan nasab untuk menghalangi dakwah. Seolah-olah susunan mushaf ini berkata: di saat pertolongan Allah datang dan arus manusia mengalir menuju iman, mereka yang membangun seluruh hidup di atas penolakan dan permusuhan akan berakhir dengan kehinaan; kemenangan agama tidak membutuhkan dukungan mereka. Di sisi lain, Al-Masad juga bisa dibaca sebagai kelanjutan praktis dari pesan Surah Al-Kauthar dan Al-Kafirun: bahwa musuh-musuh yang menyangka akan memutus keturunan dan menghentikan risalah, justru merekalah yang sejarahnya diabadikan sebagai simbol kegagalan.\\n\\nDari sisi retorika, Surah Al-Masad sangat tegas, lugas, dan penuh efek kejut. Nada yang dominan adalah nada kecaman dan pengumuman hukuman, tetapi tidak untuk memuaskan dendam pribadi, melainkan untuk meruntuhkan otoritas moral dan sosial yang dimiliki Abu Lahab di mata masyarakat. Pembukaan dengan ungkapan \"تَبَّتْ يَدَا\" (celakalah kedua tangan) merupakan formula kutukan yang sangat kuat dalam bahasa Arab, seolah-olah menutup ruang bagi anggapan bahwa proyek permusuhan Abu Lahab masih punya masa depan. Pengulangan akar kata yang sama dalam \"وَتَبَّ\" menegaskan bahwa kebinasaan itu sudah pasti dan final.\\n\\nStrategi komunikasinya bersifat sangat langsung dan publik. Menyebut Abu Lahab dengan kun-yah yang dikenal luas, bukan dengan nama aslinya, menghadirkan efek ganda: semua orang langsung tahu siapa yang dimaksud, dan sekaligus terjadi permainan makna dengan kata “lahab” (nyala api). Pendengar Arab yang fasih akan merasakan ironi pahit: orang yang dikenal dengan julukan “Si Bernyala” (karena tampang atau pesona duniawinya) justru akan berakhir di dalam api berkobar yang sesungguhnya. Gambaran visual yang tajam – api menyala, kayu bakar yang diangkut, tali kasar yang melilit leher – semua ini adalah perangkat balaghah yang menukik ke imajinasi pendengar, menjadikan surah ini sangat mudah diingat sekaligus sulit diabaikan.\\n\\nPenggambaran istri Abu Lahab sebagai “pembawa kayu bakar” dan pemilik tali dari serat kasar di lehernya juga mengandung dimensi simbolik yang kuat. Dalam budaya lisan Arab, pembawa kayu bakar bisa menjadi metafora bagi orang yang mengumpulkan bahan-bahan fitnah dan mengipasi api konflik. Tali di leher menandakan kehinaan, keterikatan, dan konsekuensi dari perbuatan yang ia pikul sendiri. Dengan begitu, surah ini menggunakan bahasa yang sangat konkret dan sekaligus kaya makna, sehingga pesan spiritual tentang konsekuensi dosa sosial dan dakwah menjadi sangat hidup dan mudah ditangkap orang awam.\\n\\nSecara keseluruhan, Surah Al-Masad menyampaikan pesan inti bahwa tidak ada bentuk kekuatan duniawi – harta, nasab, jabatan, jaringan, bahkan kedekatan darah dengan Rasul – yang bisa menyelamatkan seseorang jika ia menjadikan dirinya musuh kebenaran. Surah ini mengajarkan bahwa kekerabatan tidak menjadi tameng, dan bahwa kerjasama suami-istri bisa menjadi jalan ke surga jika mereka bersinergi dalam ketaatan, atau sebaliknya menjadi jalan ke neraka jika mereka saling menopang dalam permusuhan terhadap kebenaran. Bagi pembaca masa kini, surah ini tetap relevan sebagai peringatan terhadap arogansi kekuasaan, nepotisme, dan sikap merasa kebal hukum karena status sosial. Ia mengajarkan bahwa ukuran kemuliaan sejati adalah sikap terhadap risalah dan kebenaran, bukan siapa keluarga kita, berapa harta kita, atau seberapa kuat posisi kita di mata manusia."
}